<?php 
namespace backend\fz;
class fz{
       
      public static $code=[
             0=>"未知错误",
             1=>"签名无效",
             2=>"密码或账户有误",
             3=>"请发送token令牌",
             4=>"token令牌无效",
             5=>"token已过期",
     
             "1000"=>"分类名称不能为空",
             "1001"=>"分类名称不能少于6个字节",
             "1002"=>"分类名称不能重复",
             "1003"=>"父级不存在",
             "1004"=>"添加成功",
             "2000"=>"查询成功",
             
             "2001"=>"类名称或父级分类ID，至少有一项",
             "2002"=>"修改的分类名称不能少于6个字节",
             "2003"=>"修改分类级别如果为子及 需验证",
            
              "3000"=>"id为空",
             "3001"=>"删除分类不存在",
             "3002"=>"存在小说",
           
             "3004"=>" 删除成功", 

             "4001"=>"不能为空",
             "4002"=>"存在分类",
             "4003"=>"修改分类级别如果为子及 需验证",
              
             "5001"=>"小说id不能为空",
             "5002"=>"小说不存在",
             "5003"=>"修改分类级别如果为子及 需验证",
              
              

      ];

     public static function Ms($code,$data=array()){
     	
     	$arr=[
              "code"=>$code,
              "msg"=>self::$code[$code],
              "res"=>$data

     	];
     	echo json_encode($arr,JSON_UNESCAPED_UNICODE);die;
     }
} 